/*
* Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення залежно від значення числа.
* Якщо число ділиться на 3, то повідомлення має бути Fizz, якщо число ділиться на 5, то повідомлення має бути Buzz,
* а якщо число ділиться і на 3, і на 5, то повідомлення має бути FizzBuzz. Наприклад, для числа 15 повідомлення
* має бути FizzBuzz.
*/

// Оператор визначення остачі ділення знайшов на ресурсі https://w3schoolsua.github.io/js/js_arithmetic.html

let a = 12;

if (a % 3 === 0 && a % 5 === 0) {
    console.log(a + ': FizzBuzz');
} else if (a % 5 === 0) {
    console.log(a + ': Buzz');
} else if (a % 3 === 0) {
    console.log(a + ': Fizz');
} else {
    console.log('Число ' + a + ' не ділиться без остачі на 3 або 5');
}

/*
* Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення, що вказує, чи є введений
* рік високосним.
**/

/*
Пояснення що до розрахунку високосного року знайшов на ресурсі:
https://bankchart.com.ua/finansoviy_gid/groshi_rodini/novini/yak_viznachiti_yakiy_rik_visokosniy_

Конкретніше ось цей абзац зі статті:
"Рік вважається високосним, якщо він ділиться на 4. Винятком єроки, які кратні 100 (такі роки є високосними
тільки тоді, якщо вони ще діляться на 400)."
*/

let year = 1400;

if (year % 4 === 0 && (year % 100 !== 0 || year % 400 === 0)) {
    console.log(year + ' є високосним роком.');
} else {
    console.log(year + ' не є високосним роком.');
}

/*
* Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення у форматі
* Вам N рік / роки / років. Залежно від числа N слово рік має змінюватися на років або року. Наприклад,
* Вам 1 рік, Вам 5 років, Вам 42 роки.
*/

let age = 2;

if (age % 10 === 1 && age % 100 !== 11) {
    console.log('Вам ' + age + ' рік');
} else if ((age % 10 === 2 || age % 10 === 3 || age % 10 === 3) && (age % 100 !== 12 || age % 100 !== 13 || age % 100 !== 14)) {
    console.log('Вам ' + age + ' роки');
} else {
    console.log('Вам ' + age + ' років');
}